#正则表达式
# -*- coding: utf-8 -*-

import re

# 不要与系统重名，re.py导致报错
# . 一个字符
# * 多个 或 0 个字符
# + 至少 1个字符
# ？0个 或 1个字符
# {n} n个字符
# {n,m} n 到 m 个字符
# \s+ 至少有一个空格
# r'\s+' 用r表示正则，无需考虑转义字符
# \d 匹配数字
# \w 匹配字母  or  数字


print('Test:010-12345')
m = re.match(r'^(\d{3})-(\d{3,8})$','010-12345')   # ^ 开始，$结束
print(m.group(1),m.group(2))

t = '19:05:30'
print('Test:',t)
# m = re.match(r'^(0[0,9]|1[0,9]|2[0,3]|[0,9])\:()')
m = re.match(r'^(0[0-9]|1[0-9]|2[0-3]|[0-9])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9]|[0-9])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9]|[0-9])$', t)

print(m.groups())

# re.split(r'[\s\,\;]+','a,b;;c  d') #至少有1个空格、逗号、分号
